// 7.Напишите программу, которая принимает на вход
// трёхзначное число и на выходе показывает последнюю цифру
// этого числа.
// 456 -> 6
// 782 -> 2
// 918 -> 8

Console.WriteLine("Введите трёхзначное число");
int num = Convert.ToInt32(Console.ReadLine());

if (100 > num || num > 999)
{
  Console.Write("Вы ввели не верное число");
}
else
{
  int lastNum = num % 10;
  Console.Write($"Последняя цифра в Вашем числе = {lastNum}");
}