// 5.Напишите программу, которая на вход принимает
// одно число (N), а на выходе показывает все целые
// числа в промежутке от -N до N.
// 4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4"
// 2 -> " -2, -1, 0, 1, 2"
// Итерация №2
// Решение в группах задач: 20 мин

Console.WriteLine("введите целое положительное число");
int numA = Convert.ToInt32(Console.ReadLine());
if (numA > 0)
{
  for (int i = -numA; i <= numA; i++)
  {
    int count = i;
    Console.Write($"{count} ");
  }
}
else
{
  Console.Write("введены не корректные данные");
}